from itertools import product
import numpy as np
from conf import *


def get_combs(*args):
    res = ['']
    for li in args:
        prefix = res
        res = []
        for ch in li:
            buf = [s + ch for s in prefix]
            res += buf

    return res


infer_7 = {
    'crop_rect': {
        'left': 455,
        'right': 833,
        'top': 295,
        'bottom': 545
    },
    'warp_key_pts': {
        'top': np.array([
            [190, 68], [182, 68], [160, 67], [137, 65], [113, 62],
            [90, 57], [69, 52], [43, 45]
        ], dtype=np.int32),
        'bottom': np.array([
            [190, 240], [159, 240], [132, 244], [104, 240], [78, 234],
            [56, 228], [36, 219], [10, 207]
        ], dtype=np.int32)
    },
    'char_chk_range': [70, 180],
    'concat_overlap': 108,
    'target': [
                # '착발',
                # '발식',
                # '신관',
                # '한화',
                # '로트',
                # '충격',
                # 'K-M'
                'M526',
                '526',
                ],
    'common_ocr_error': [
        ['K', get_combs(['|'], ['<'])],
        ['착발', get_combs(['착', '칙', '작', '학', '최', '각'], ['빌', '발'])],
        ['발식', get_combs(['발', '별'], ['식', '심', '색'])],
        ['충격', get_combs(['총', '중', '통', '충'], ['격', '편'])],
        ['신관', get_combs(['신', '산', '쇠', '스'], ['판', '화', '관', '공', '근'])],
        ['한화', get_combs(['환', '한', '현'], ['화', '회', '하'])],
        ['로트', get_combs(['로', '르', '크', '모', '코'], ['르', '트', '드', '토','는'])],
        ['M526', get_combs(['M', 'm'], ['S', 's', '6', '$'], ['2', 'ㄹ'], ['6', '5'])],
        ['충격', get_combs(['충', '춤', '층', '훙'], ['격', '겨', '6'], ['ㄹ'], ['5'])],
        ['526', get_combs(['5', 'S', 's', '$'], ['2', 'ㄹ', 'j'], ['6', '5'])],
        ['K-M', get_combs(['K', '<'], ['-', 'ㅡ'], ['M', 'm'])]
        # ['1', ['/']],
        # ['', ['.', '\'', '\"', '=', '+', '<', '>', '(', ')', '{', '}', '[', ']', '<', '>']]
    ]
}

infer_7['warp_key_pts']['top'][:, 0] += 3
infer_7['warp_key_pts']['bottom'][:, 0] += 3

infer_14 = {
    'crop_rect': {
        'left': 410,
        'right': 875,
        'top': 490,
        'bottom': 890
    },
    'target': ['경고', '81', 'mm', '박격포', '발사', '증가', '추진', '개까지', '개이상', '사용시', 'five', 'ive', 'use', 'not', 'warning', 'warn', 'ing', 'incre', 'firing', 'mortar', 'more', 'than', ],
    'common_ocr_error': [
        ['경고', get_combs(['검', '걱'], ['고'])],
        ['81', get_combs(['g', '8'], ['l', 'I'])],
        ['m', ['n', 'r']],
        ['박격포', get_combs(['박', '바'], ['려', '경', '견', '겨', '격'], ['포'])],
        ['발사', get_combs(['밥', '반'], ['사'])],
        ['시에', ['기예']],
        ['증가', get_combs(['증', '중', '종'], ['가', '기'])],
        ['추진약', ['추진악']],
        ['까지', get_combs(['가', '퍼'], ['지'])],
        ['개이상', get_combs(['개', '캐', '객'], ['이', '비', '미'], ['상', '사', '심', '신'])],
        ['사용', ['시용']],
        ['five', get_combs(['f', 'F'], ['i', 'I', 'j', 'J'], ['v', 'V'], ['e', 'E'])],
        ['ive', get_combs(['i', 'I', 'f'], ['v', 'V'], ['e', 'E'])],
        ['use', get_combs(['u', 'U'], ['s', 'S'], ['e', 'E'])],
        ['not', get_combs(['n', 'N'], ['o', 'O'], ['t', 'T'])],
        ['warn', get_combs(['w', 'W'], ['a', 'A'], ['r', 'R'], ['n', 'N'])],
        ['ing', get_combs(['i', 'I'], ['n', 'N'], ['g', 'G'])],
        ['incre', get_combs(['i', 'I', '('], ['n', 'N'], ['c', 'C'], ['r', 'R'], ['e', 'e'])],
        ['firing', get_combs(['f', 'F'], ['i', 'I'], ['r', 'R'], ['i', 'I'], ['n', 'N'], ['g', 'G'])],
        ['mortar', get_combs(['m', 'M'], ['o', 'O'], ['r', 'R'], ['t', 'T'], ['a', 'A'], ['r', 'R'])],
        ['more', get_combs(['m', 'M'], ['o', 'O'], ['r', 'R'], ['e', 'E'])],
        ['than', get_combs(['t', 'T'], ['h', 'H'], ['a', 'A'], ['n', 'N'])],
    ],
    'threshold': 1
}

 #   std = "81MM COMP B KM374 고폭탄"
 # "고폭탄", "연습탄", "훈련탄", "조명탄", "백린연막탄"
infer_12_13_19_22 = {
    'target': ['81', 'MM', 'COMP', 'KM', 'M374', '374', '고폭', '연습', '훈련', '조명', '백린', '탄'],
    'common_ocr_error': [
        ['81', get_combs(['8','B','3'], ['i', 'l', 'I','|'])],
        ['MM', get_combs(['m', 'M'], ['m', 'M'])],
        ['COMP', get_combs(['c', 'C', 'G'], ['O', 'o', 'c', 'C'], ['M', 'm'], ['p', 'P', 'f', 'F'])],
        ['KM', get_combs(['k', 'K'], ['m', 'M'])],
        ['M374', get_combs(['m3', 'M3'], ['74', '7나'])],
        ['374', get_combs(['3', '8'], ['7', 'ㄱ'], ['4', '나'])],
        ['고폭', get_combs(['고', '그'], ['폭', '픅', '족', '쪽', '목', '독', '측'])],
        ['연습', get_combs(['연', '인', '임', '입'], ['습', '슴', '승', '즘'])],
        ['훈련', get_combs(['훈', '흔', '흠', '훈'], ['련', '린', '년'])],
        ['조명', get_combs(['조', '고'], ['명', '면', '연'])],
        ['백린', get_combs(['백', '맥', '빅'], ['린', '림', '닌'])],
        ['탄', get_combs(['탄', '단', '판', '본', '한', '된'])]
    ]
}

infer_12_13 = {
    'len' : CONFIG['OCR']['LEN']

}